app/controllers/posts_controller.rb

  def new
    @post = Post.new
    if !params[:author_id].blank?
      @author = Author.find_by_id(params[:author_id].to_i)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]